turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U1C.atdf
          </instance>
        </module>
        <module name="RTC" version="6056O">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1260"/>
          </instance>
        </module>
        <module name="RTT" version="6081I">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1230"/>
          </instance>
        </module>
        <module name="SMC" version="6411D">
          <instance name="SMC">
            <register-group address-space="base" name="SMC" name-in-module="SMC" offset="0x400E0000"/>
          </instance>
        </module>
        <module name="SPI" version="6088W">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA13" function="A" group="MISO"/>
              <signal pad="PA14" function="A" group="MOSI"/>
              <signal pad="PA16" function="A" group="NPCS" index="0"/>
              <signal pad="PA0" function="B" group="NPCS" index="1"/>
              <signal pad="PC3" function="B" group="NPCS" index="1"/>
              <signal pad="PC19" function="B" group="NPCS" index="1"/>
              <signal pad="PA1" function="B" group="NPCS" index="2"/>
              <signal pad="PC4" function="B" group="NPCS" index="2"/>
              <signal pad="PC14" function="B" group="NPCS" index="2"/>
              <signal pad="PA19" function="B" group="NPCS" index="3"/>
              <signal pad="PC5" function="B" group="NPCS" index="3"/>
              <signal pad="PA15" function="A" group="SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SSC" version="6078M">
          <instance name="SSC">
            <register-group address-space="base" name="SSC" name-in-module="SSC" offset="0x40004000"/>
            <signals>
              <signal pad="PA27" function="A" group="RD"/>
              <signal pad="PA31" function="A" group="RF"/>
              <signal pad="PA29" function="A" group="RK"/>
              <signal pad="PA26" function="A" group="TD"/>
              <signal pad="PA30" function="A" group="TF"/>
              <signal pad="PA28" function="A" group="TK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="6452S">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1210"/>
          </instance>
        </module>
        <module name="TC" version="6082ZF">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40080000"/>
            <signals>
              <signal pad="PA2" function="A" group="TCLK" index="0"/>
              <signal pad="PB4" function="A" group="TCLK" index="1"/>
              <signal pad="PA26" function="B" group="TCLK" index="2"/>
              <signal pad="PA1" function="A" group="TIOA" index="0"/>
              <signal pad="PB5" function="A" group="TIOA" index="1"/>
              <signal pad="PA30" function="B" group="TIOA" index="2"/>
              <signal pad="PA0" function="A" group="TIOB" index="0"/>
              <signal pad="PB6" function="A" group="TIOB" index="1"/>
              <signal pad="PA31" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" version="6212O">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x40084000"/>
            <signals>
              <signal pad="PA10" function="A" group="TWCK" index="0"/>
              <signal pad="PA9" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x40088000"/>
            <signals>
              <signal pad="PA25" function="A" group="TWCK" index="1"/>
              <signal pad="PA24" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418H">
          <instance name="UART">
            <register-group address-space="base" name="UART" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PA11" function="A" group="URXD"/>
              <signal pad="PA12" function="A" group="UTXD"/>
            </signals>
          </instance>
        </module>
        <module name="UDPHS" version="6227O">
          <instance name="UDPHS">
            <register-group address-space="base" name="UDPHS" name-in-module="UDPHS" offset="0x400A4000"/>
          </instance>
        </module>
        <module name="USART" version="6089ZC">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40090000"/>
            <signals>
              <signal pad="PB8" function="A" group="CTS" index="0"/>
              <signal pad="PB11" function="B" group="DCD" index="0"/>
              <signal pad="PB10" function="B" group="DSR" index="0"/>
              <signal pad="PB9" function="B" group="DTR" index="0"/>
              <signal pad="PB12" function="B" group="RI" index="0"/>
              <signal pad="PB7" function="A" group="RTS" index="0"/>
              <signal pad="PA19" function="A" group="RXD" index="0"/>
              <signal pad="PA17" function="A" group="SCK" index="0"/>
              <signal pad="PA18" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40094000"/>
            <signals>
              <signal pad="PA23" function="B" group="CTS" index="1"/>
              <signal pad="PA22" function="B" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA24" function="B" group="SCK" index="1"/>
              <signal pad="PA20" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x40098000"/>
            <signals>
              <signal pad="PB22" function="B" group="CTS" index="2"/>
              <signal pad="PB21" function="B" group="RTS" index="2"/>
              <signal pad="PA23" function="A" group="RXD" index="2"/>
              <signal pad="PA25" function="B" group="SCK" index="2"/>
              <signal pad="PA22" function="A" group="TXD" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" version="6080F">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1250"/>
