turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U1C.atdf
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Write Protect Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="CKGR_MOR__MOSCRCF">
        <value caption="The Fast RC Oscillator Frequency is at 4 MHz (default)" name="_4_MHz" value="0x0"/>
        <value caption="The Fast RC Oscillator Frequency is at 8 MHz" name="_8_MHz" value="0x1"/>
        <value caption="The Fast RC Oscillator Frequency is at 12 MHz" name="_12_MHz" value="0x2"/>
      </value-group>
      <value-group caption="" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLLClock is selected" name="UPLL_CLK" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
      </value-group>
      <value-group caption="" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" name="PWM" version="6343J">
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x000000FF" name="DIVA"/>
          <bitfield caption="CLKA, CLKB Source Clock Selection" mask="0x00000F00" name="PREA"/>
          <bitfield caption="CLKA, CLKB Divide Factor" mask="0x00FF0000" name="DIVB"/>
          <bitfield caption="CLKA, CLKB Source Clock Selection" mask="0x0F000000" name="PREB"/>
        </register>
