turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U1C.atdf
        <register caption="UDPHS Endpoint Control Enable Register (endpoint = 6)" name="UDPHS_EPTCTLENB6" offset="0x1C4" rw="W" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Enable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Enable" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Enable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Enable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Enable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Send/Short Packet Interrupt Enable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Disable Register (endpoint = 6)" name="UDPHS_EPTCTLDIS6" offset="0x1C8" rw="W" size="4">
          <bitfield caption="Endpoint Disable" mask="0x00000001" name="EPT_DISABL"/>
          <bitfield caption="Packet Auto-Valid Disable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Enable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Disable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Disable" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Disable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Disable" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP Interrupt Disable" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Disable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Disable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Disable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Disable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Register (endpoint = 6)" name="UDPHS_EPTCTL6" offset="0x1CC" rw="R" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enabled (Not for CONTROL Endpoints)" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupt Disables DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Enabled" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enabled" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enabled" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Enabled" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP Interrupt Enabled" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Enabled" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Enabled" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Enabled" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enabled" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Enabled" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Set Status Register (endpoint = 6)" name="UDPHS_EPTSETSTA6" offset="0x1D4" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Set" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="KILL Bank Set (for IN Endpoint)" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="TX Packet Ready Set" mask="0x00000800" name="TXRDY"/>
        </register>
        <register caption="UDPHS Endpoint Clear Status Register (endpoint = 6)" name="UDPHS_EPTCLRSTA6" offset="0x1D8" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Clear" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Data Toggle Clear" mask="0x00000040" name="TOGGLESQ"/>
          <bitfield caption="Received OUT Data Clear" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Clear" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="Received SETUP Clear" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Clear" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Clear" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Clear" mask="0x00008000" name="NAK_OUT"/>
        </register>
        <register caption="UDPHS Endpoint Status Register (endpoint = 6)" name="UDPHS_EPTSTA6" offset="0x1DC" rw="R" size="4">
          <bitfield caption="Stall Handshake Request" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Toggle Sequencing" mask="0x000000C0" name="TOGGLESQ_STA" values="UDPHS_EPTSTA6__TOGGLESQ_STA"/>
          <bitfield caption="Overflow Error" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data/KILL Bank" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAK IN" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAK OUT" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Current Bank/Control Direction" mask="0x00030000" name="CURBK_CTLDIR"/>
          <bitfield caption="Busy Bank Number" mask="0x000C0000" name="BUSY_BANK_STA" values="UDPHS_EPTSTA6__BUSY_BANK_STA"/>
          <bitfield caption="UDPHS Byte Count" mask="0x7FF00000" name="BYTE_COUNT"/>
          <bitfield caption="Short Packet" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 0)" name="UDPHS_DMANXTDSC0" offset="0x300" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 0)" name="UDPHS_DMAADDRESS0" offset="0x304" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Control Register (channel = 0)" name="UDPHS_DMACONTROL0" offset="0x308" rw="RW" size="4">
          <bitfield caption="(Channel Enable Command)" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable (Command)" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable (Control)" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="UDPHS DMA Channel Status Register (channel = 0)" name="UDPHS_DMASTATUS0" offset="0x30C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 1)" name="UDPHS_DMANXTDSC1" offset="0x310" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 1)" name="UDPHS_DMAADDRESS1" offset="0x314" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Control Register (channel = 1)" name="UDPHS_DMACONTROL1" offset="0x318" rw="RW" size="4">
          <bitfield caption="(Channel Enable Command)" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable (Command)" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable (Control)" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="UDPHS DMA Channel Status Register (channel = 1)" name="UDPHS_DMASTATUS1" offset="0x31C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 2)" name="UDPHS_DMANXTDSC2" offset="0x320" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 2)" name="UDPHS_DMAADDRESS2" offset="0x324" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
